export default class riddlesModal {
    name: string ="";
    picture:string="";
    riddles:singleRiddle[]=[];
}

class singleRiddle{
    riddle:string="";
    answer:string=""
}



// const riddles6 = {
//     name: "אותיות מבלבלות - חיות",
//     picture: "",
//     riddles: [
//         { "riddle": "גד", "answer": "דג" },
//         { "riddle": "ברקע", "answer": "עקרב" },
//         { "riddle": "ושתי", "answer": "יתוש" },
//         { "riddle": "לפי", "answer": "פיל" },
//         { "riddle": "שיכר", "answer": "כריש" },
//         { "riddle": "בד", "answer": "דב" },
//         { "riddle": "פצע", "answer": "צפע" },
//         { "riddle": "הברז", "answer": "זברה" },
//         { "riddle": "הגרילו", "answer": "גורילה" },
//         { "riddle": "יותך", "answer": "תוכי" },
//         { "riddle": "לחות", "answer": "חתול" },
//         { "riddle": "מגל", "answer": "גמל" },
//         { "riddle": "לינתו", "answer": "לויתן" },
//         { "riddle": "עצוב", "answer": "צבוע" },
//         { "riddle": "שופין", "answer": "ינשוף" },
//         { "riddle": "נתין", "answer": "תנין" },
//         { "riddle": "הנמל", "answer": "נמלה" },
//         { "riddle": "רפתן", "answer": "פנתר" },
//         { "riddle": "מזודה", "answer": "מדוזה" },
//         { "riddle": "מאד", "answer": "אדם" },
//         { "riddle": "נפרק", "answer": "קרנף" },
//         { "riddle": "מורח", "answer": "חמור" },
//         { "riddle": "בצי", "answer": "צבי" },
//         { "riddle": "בכל", "answer": "כלב" },
//         { "riddle": "סנטר", "answer": "סרטן" }
//     ]}
  


// const riddles5 = {
//         name: "אותיות מבלבלות - אברים",
//         picture: "",
//         riddles: [
//             {
//                 "riddle": "אשר",
//                 "answer": "ראש"
//             },
//             {
//                 "riddle": "די",
//                 "answer": "יד"
//             },
//             {
//                 "riddle": "בישן",
//                 "answer": "ישבן"
//             },
//             {
//                 "riddle": "עצל",
//                 "answer": "צלע"
//             },
//             {
//                 "riddle": "צמח",
//                 "answer": "מצח"
//             },
//             {
//                 "riddle": "נבט",
//                 "answer": "בטן"
//             },
//             {
//                 "riddle": "נפרצו",
//                 "answer": "ציפורן"
//             },
//             {
//                 "riddle": "קעור",
//                 "answer": "עורק"
//             },
//             {
//                 "riddle": "יכולת",
//                 "answer": "כליות"
//             },
//             {
//                 "riddle": "עממי",
//                 "answer": "מעיים"
//             },
//             {
//                 "riddle": "רוטב",
//                 "answer": "טבור"
//             },
//             {
//                 "riddle": "סרטן",
//                 "answer": "סנטר"
//             },
//             {
//                 "riddle": "צבע",
//                 "answer": "עצב"
//             },
//             {
//                 "riddle": "חם",
//                 "answer": "מח"
//             },
//             {
//                 "riddle": "עשיר",
//                 "answer": "שיער"
//             },
//             {
//                 "riddle": "כפת",
//                 "answer": "כתף"
//             },
//             {
//                 "riddle": "רכב",
//                 "answer": "ברך"
//             },
//             {
//                 "riddle": "חרם",
//                 "answer": "רחם"
//             },
//             {
//                 "riddle": "גורן",
//                 "answer": "גרון"
//             },
//             {
//                 "riddle": "חיש",
//                 "answer": "שחי"
//             },
//             {
//                 "riddle": "מפרק",
//                 "answer": "מרפק"
//             },
//             {
//                 "riddle": "סירים",
//                 "answer": "ריסים"
//             },
//             {
//                 "riddle": "קבע",
//                 "answer": "עקב"
//             },
//             {
//                 "riddle": "תוכן",
//                 "answer": "תנוך"
//             },
//             {
//                 "riddle": "גדי",
//                 "answer": "גיד"
//             }
//         ]


//     }

// const riddles4 = {
//         name: "אותיות מבולבולות - מקצועות",
//         picture: "",
//         riddles: [
//             {
//                 "riddle": "הגן",
//                 "answer": "נהג"
//             },
//             {
//                 "riddle": "הורם",
//                 "answer": "מורה"
//             },
//             {
//                 "riddle": "ואחת",
//                 "answer": "אחות"
//             },
//             {
//                 "riddle": "רב שרב",
//                 "answer": "שרברב"
//             },
//             {
//                 "riddle": "טיח",
//                 "answer": "חיט"
//             },
//             {
//                 "riddle": "פארו",
//                 "answer": "רופא"
//             },
//             {
//                 "riddle": "רגן",
//                 "answer": "נגר"
//             },
//             {
//                 "riddle": "כלור",
//                 "answer": "רוכל"
//             },
//             {
//                 "riddle": "זנב",
//                 "answer": "זבן"
//             },
//             {
//                 "riddle": "כאימון",
//                 "answer": "מכונאי"
//             },
//             {
//                 "riddle": "רושם",
//                 "answer": "שומר"
//             },
//             {
//                 "riddle": "ינקר",
//                 "answer": "ירקן"
//             },
//             {
//                 "riddle": "יקרן",
//                 "answer": "קרין"
//             },
//             {
//                 "riddle": "פרסית",
//                 "answer": "ספרית"
//             },
//             {
//                 "riddle": "תבניתך",
//                 "answer": "כתבנית"
//             },
//             {
//                 "riddle": "חבט",
//                 "answer": "טבח"
//             },
//             {
//                 "riddle": "תנגן",
//                 "answer": "גננת"
//             },
//             {
//                 "riddle": "דרכים",
//                 "answer": "מדריך"
//             },
//             {
//                 "riddle": "הלימון",
//                 "answer": "יהלומן"
//             },
//             {
//                 "riddle": "תרופת",
//                 "answer": "תופרת"
//             },
//             {
//                 "riddle": "יפקד",
//                 "answer": "פקיד"
//             },
//             {
//                 "riddle": "חוסר",
//                 "answer": "סוחר"
//             },
//             {
//                 "riddle": "שורט",
//                 "answer": "שוטר"
//             },
//             {
//                 "riddle": "נאם",
//                 "answer": "אמן"
//             },
//             {
//                 "riddle": "פנתר",
//                 "answer": "רפתן"
//             }
//         ]

//     }

// const riddles3 = {
//         name: "אותיות מבולבלות - ישובים ",
//         picture: "",
//         riddles: [
//             {
//                 "riddle": "יחפה",
//                 "answer": "חיפה"
//             },
//             {
//                 "riddle": "ברא עשב",
//                 "answer": "באר שבע"
//             },
//             {
//                 "riddle": "חרדה",
//                 "answer": "חדרה"
//             },
//             {
//                 "riddle": "רעד",
//                 "answer": "ערד"
//             },
//             {
//                 "riddle": "השד קובר",
//                 "answer": "שדה בוקר"
//             },
//             {
//                 "riddle": "קפואים",
//                 "answer": "אופקים"
//             },
//             {
//                 "riddle": "צנרת",
//                 "answer": "נצרת"
//             },
//             {
//                 "riddle": "בחורות",
//                 "answer": "רחובות"
//             },
//             {
//                 "riddle": "חלונו",
//                 "answer": "חולון"
//             },
//             {
//                 "riddle": "דורשת",
//                 "answer": "שדרות"
//             },
//             {
//                 "riddle": "חמורי",
//                 "answer": "ירוחם"
//             },
//             {
//                 "riddle": "נהנתי",
//                 "answer": "נתניה"
//             },
//             {
//                 "riddle": "בינה",
//                 "answer": "יבנה"
//             },
//             {
//                 "riddle": "ולד",
//                 "answer": "לוד"
//             },
//             {
//                 "riddle": "ספרד נחה",
//                 "answer": "פרדס חנה"
//             },
//             {
//                 "riddle": "אשר יפנה",
//                 "answer": "ראש פינה"
//             },
//             {
//                 "riddle": "מוסד",
//                 "answer": "סדום"
//             },
//             {
//                 "riddle": "בתי מלח",
//                 "answer": "בית לחם"
//             },
//             {
//                 "riddle": "זורכן עקבי",
//                 "answer": "זכרון יעקב"
//             },
//             {
//                 "riddle": "מרת שרונה",
//                 "answer": "רמת השרון"
//             },
//             {
//                 "riddle": "פעולה",
//                 "answer": "עפולה"
//             },
//             {
//                 "riddle": "ענן",
//                 "answer": "נען"
//             },
//             {
//                 "riddle": "שאר הקרינה",
//                 "answer": "ראש הניקרה"
//             },
//             {
//                 "riddle": "הצמד",
//                 "answer": "מצדה"
//             },
//             {
//                 "riddle": "די מדריך",
//                 "answer": "יד מרדכי"
//             }
//         ]

//     }

// const riddles2 = {
//         name: "צמדים והיפוכם",
//         picture: "",
//         riddles:
//             [
//                 {
//                     "riddle": "שכחת לאה",
//                     "answer": "זכרון יעקב"
//                 },
//                 {
//                     "riddle": "חול מלחמה",
//                     "answer": "שבת שלום"
//                 },
//                 {
//                     "riddle": "האוהל השחור",
//                     "answer": "הבית הלבן"
//                 },
//                 {
//                     "riddle": "עיני מרדכי",
//                     "answer": "אוזני המן"
//                 },
//                 {
//                     "riddle": "השעבוד הקטן",
//                     "answer": "החופש הגדול"
//                 },
//                 {
//                     "riddle": "המזרח המסודר",
//                     "answer": "המערב הפרוע"
//                 },
//                 {
//                     "riddle": "נשואה לבנה",
//                     "answer": "אלמנה שחורה"
//                 },
//                 {
//                     "riddle": "יבשת הסוכר",
//                     "answer": "ים המלח"
//                 },
//                 {
//                     "riddle": "אוהל הירח",
//                     "answer": "בית שמש"
//                 },
//                 {
//                     "riddle": "עיר סבתא",
//                     "answer": "כפר סבא"
//                 },
//                 {
//                     "riddle": "חום חתולים",
//                     "answer": "קור כלבים"
//                 },
//                 {
//                     "riddle": "נשר מלחמה",
//                     "answer": "יונת שלום"
//                 },
//                 {
//                     "riddle": "ירד במים",
//                     "answer": "עלה באש"
//                 },
//                 {
//                     "riddle": "איטיות החושך",
//                     "answer": "מהירות האור"
//                 },
//                 {
//                     "riddle": "הקיא אותו",
//                     "answer": "אכל אותה"
//                 },
//                 {
//                     "riddle": "שלום עבדות",
//                     "answer": "מלחמת השחרור"
//                 },
//                 {
//                     "riddle": "חי מהתעניינות",
//                     "answer": "מת משעמום"
//                 },
//                 {
//                     "riddle": "המכוער הער",
//                     "answer": "היפיפייה הנרדמת"
//                 },
//                 {
//                     "riddle": "ירקות רטובים",
//                     "answer": "פירות יבשים"
//                 },
//                 {
//                     "riddle": "לטיפת ירח",
//                     "answer": "מכת שמש"
//                 },

//                 {
//                     "riddle": "כביש הבשר",
//                     "answer": "שביל החלב"
//                 },
//                 {
//                     "riddle": "מקולל ההולך",
//                     "answer": "ברוך הבא"
//                 },
//                 {
//                     "riddle": "טביעת בטן",
//                     "answer": "שחיית גב"
//                 },
//                 {
//                     "riddle": "בריא גוף",
//                     "answer": "חולה נפש"
//                 },
//                 {
//                     "riddle": "אחיך ההולך ישר",
//                     "answer": "אחותך הצולעת"
//                 },
//                 {
//                     "riddle": "כבויה תחתיו",
//                     "answer": "דלוקה עליו"
//                 },
//                 {
//                     "riddle": "יש לה אום מיותר",
//                     "answer": "חסר לו בורג"
//                 },
//                 {
//                     "riddle": "הפסד מלוכלך",
//                     "answer": "רווח נקי"
//                 }
//             ]
//     }
          

// const riddles1 = {
//         name: "חידון פילים",
//         picture: "",
//         riddles:
//             [
//                 {
//                     "riddle": "פיל בתזמורת",
//                     "answer": "פילהרמונית"
//                 },
//                 {
//                     "riddle": "פיל שהוא פרצוף מהצד",
//                     "answer": "פרופיל"
//                 },
//                 {
//                     "riddle": "פיל שהוא תבלין",
//                     "answer": "פלפל"
//                 },
//                 {
//                     "riddle": "עיר של פילים",
//                     "answer": "פילדלפיה"
//                 },
//                 {
//                     "riddle": "ארץ של פילים",
//                     "answer": "פיליפינים"
//                 },
//                 {
//                     "riddle": "פיל קרציה",
//                     "answer": "טפיל"
//                 },
//                 {
//                     "riddle": "פיל נדיב",
//                     "answer": "פילנטרופ"
//                 },
//                 {
//                     "riddle": "פיל במחלת הנפילה",
//                     "answer": "אפיפסיה"
//                 },
//                 {
//                     "riddle": "פיל שעולה לארץ באניה",
//                     "answer": "מעפיל"
//                 },
//                 {
//                     "riddle": "פיל ירק",
//                     "answer": "פלפל"
//                 },
//                 {
//                     "riddle": "פיל שדתיים מניחים בבוקר",
//                     "answer": "תפילין"
//                 },
//                 {
//                     "riddle": "פיל שהוא סוג של קפה",
//                     "answer": "פילטר"
//                 },
//                 {
//                     "riddle": "פיל במכשיר גילוח חשמלי",
//                     "answer": "פיליפס"
//                 },
//                 {
//                     "riddle": "פיל ענק",
//                     "answer": "נפיל"
//                 },
//                 {
//                     "riddle": "פיל שהוא במאי קולנוע",
//                     "answer": "סטיבן שפילברג"
//                 },
//                 {
//                     "riddle": "פיל שגורם לעלה להיות ירוק",
//                     "answer": "כלורופיל"
//                 },
//                 {
//                     "riddle": "פיל שמגדיל את הכמות פי כמה",
//                     "answer": "מכפיל"
//                 },
//                 {
//                     "riddle": "פיל שעושה עננים בבוקר",
//                     "answer": "ערפילים"
//                 },
//                 {
//                     "riddle": "פיל סטייק",
//                     "answer": "פילה"
//                 },
//                 {
//                     "riddle": "פיל שהוא מאמן כדורסל",
//                     "answer": "פיל גקסון"
//                 },
//                 {
//                     "riddle": "פילש הוא חתול כתום",
//                     "answer": "גארפילד"
//                 },
//                 {
//                     "riddle": "פיל שהוא דג פולני",
//                     "answer": "גפילטפיש"
//                 },
//                 {
//                     "riddle": "פילה שמורידה שיערות",
//                     "answer": "אפילציה"
//                 },
//                 {
//                     "riddle": "פילה שהיא חברה של פיל נשוי",
//                     "answer": "פילגש"
//                 },
//                 {
//                     "riddle": "פיל מבייש ומעליב",
//                     "answer": "משפיל"
//                 },
//                 {
//                     "riddle": "פיל הוגה דעות",
//                     "answer": "פילוסוף"
//                 },
//                 {
//                     "riddle": "פיל בנעלי ספורט",
//                     "answer": "פיהל"
//                 },
//                 {
//                     "riddle": "פיל במצלמה",
//                     "answer": "פילם"
//                 },
//                 {
//                     "riddle": "פיל שהוא סוג של בצק",
//                     "answer": "פילו"
//                 },
//                 {
//                     "riddle": "פיל שהוא בצק מוכן/ חברת אפייה",
//                     "answer": "פילסברי"
//                 },
//                 {
//                     "riddle": "פיל שעושה צניחה מהירה",
//                     "answer": "נפילה"
//                 },
//                 {
//                     "riddle": "פיל שהוא מקום מפורסם בחולון",
//                     "answer": "פילבוקס"
//                 },
//                 {
//                     "riddle": "פיל שהוא גברת קטנה",
//                     "answer": "פילפלת"
//                 },
//                 {
//                     "riddle": "פיל שדומה לאנשים מפורסמים אחרים",
//                     "answer": "כפיל"
//                 },
//                 {
//                     "riddle": "פיל עם עור נפלא לפנים",
//                     "answer": "פילינג"
//                 }]
//     }
// export default {
//     riddles1,
//     riddles2,
//     riddles3,
//     riddles4,
//     riddles5,
//     riddles6,
// }